Repository: ersus93/bbalert
Catalog: locales/*/LC_MESSAGES/bbalert.po
Languages: pt

source: 🚀 *¡Bot en línea!* 🚀 🤖 `BitBread Alert v{version}` 🪪 `PID: {pid}` 🐍 `Python: v{python_version}` ✅ Ejecutado y funcionando perfectamente.
pt: 🚀 *Bot online!* 🚀 🤖 `BitBread Alert v{version}` 🪪 `PID: {pid}` 🐍 `Python: v{python_version}` ✅ Executado e funcionando perfeitamente.

source: **Precios Actuales:**
pt: **Preços Atuais:**

source: 🤯 *HBD TOCÓ $1.10 (O MÁS)*
pt: 🤯 *HBD ATINGIU $1.10 (OU MAIS)*

source: 🤯 Alerta MÁXIMA: HBD ≥ $1.10
pt: 🤯 Alerta MÁXIMO: HBD ≥ $1.10

source: 📉 *HBD acaba de caer de $1.10*
pt: 📉 *HBD acaba de cair de $1.10*

source: 📉 Alerta: HBD bajó de $1.10
pt: 📉 Alerta: HBD caiu de $1.10

source: 📈 Alerta: HBD superó $1.05
pt: 📈 Alerta: HBD superou $1.05

source: 📉 *HBD acaba de caer de $1.05.*
pt: 📉 *HBD acaba de cair de $1.05.*

source: 📉 Alerta: HBD cayó de $1.05
pt: 📉 Alerta: HBD caiu de $1.05

source: ⚠️ *HBD superó $1.005.*
pt: ⚠️ *HBD superou $1.005.*

source: ⚠️ Alerta: HBD superó $1.005
pt: ⚠️ Alerta: HBD superou $1.005

source: 📉 *HBD cayó de $1.005.*
pt: 📉 *HBD caiu de $1.005.*

source: 📉 Alerta: HBD cayó de $1.005
pt: 📉 Alerta: HBD caiu de $1.005

source: ⚠️ *HBD superó $1.00.*
pt: ⚠️ *HBD superou $1.00.*

source: ⚠️ Alerta: HBD superó $1.00
pt: ⚠️ Alerta: HBD superou $1.00

source: 📉 *HBD cayó de $1.00.*
pt: 📉 *HBD caiu de $1.00.*

source: 📉 Alerta: HBD cayó de $1.00
pt: 📉 Alerta: HBD caiu de $1.00

source: 🚨 *HBD cayó por debajo de $0.995.
pt: 🚨 *HBD caiu abaixo de $0.995.

source: 🚨 Alerta: 😣 HBD cayó por debajo de $0.995
pt: 🚨 Alerta: 😣 HBD caiu abaixo de $0.995

source: 🚨 *HBD subió por encima de $0.995.*
pt: 🚨 *HBD subiu acima de $0.995.*

source: 🚨 Alerta: 😃 HBD subió por encima de $0.995
pt: 🚨 Alerta: 😃 HBD subiu acima de $0.995

source: 🚨 *HBD subió por encima de $0.98.*
pt: 🚨 *HBD subiu acima de $0.98.*

source: 🚨 Alerta: 😃 HBD subió por encima de $0.98
pt: 🚨 Alerta: 😃 HBD subiu acima de $0.98

source: 🚨 *HBD cayó por debajo de $0.98.*
pt: 🚨 *HBD caiu abaixo de $0.98.*

source: 🚨 Alerta: 😣 HBD cayó por debajo de $0.98
pt: 🚨 Alerta: 😣 HBD caiu abaixo de $0.98

source: 🚨 *HBD subió por encima de $0.95.*
pt: 🚨 *HBD subiu acima de $0.95.*

source: 🚨 Alerta: 😃 HBD subió por encima de $0.95
pt: 🚨 Alerta: 😃 HBD subiu acima de $0.95

source: 🚨 *HBD cayó por debajo de $0.95.*
pt: 🚨 *HBD caiu abaixo de $0.95.*

source: 🚨 Alerta: 😣 HBD cayó por debajo de $0.95
pt: 🚨 Alerta: 😣 HBD caiu abaixo de $0.95

source: 📈 ¡Alerta de Precio! 📈 *{coin}* ha *SUPERADO* tu objetivo de *${target_price:,.4f}*. Precio actual: *${current_price:,.4f}*
pt: 📈 Alerta de Preço! 📈 *{coin}* *SUPEROU* seu objetivo de *${target_price:,.4f}*. Preço atual: *${current_price:,.4f}*

source: 📉 ¡Alerta de Precio! 📉 *{coin}* ha *CAÍDO POR DEBAJO* de tu objetivo de *${target_price:,.4f}*. Precio actual: *${current_price:,.4f}*
pt: 📉 Alerta de Preço! 📉 *{coin}* *CAIU ABAIXO* de seu objetivo de *${target_price:,.4f}*. Preço atual: *${current_price:,.4f}*

source: 🗑️ Borrar esta alerta
pt: 🗑️ Excluir este alerta

source: 🔕 Desactivar estas alertas
pt: 🔕 Desativar estes alertas

source: 📊 *Alerta de tus monedas ({intervalo_h}h):*
pt: 📊 *Alerta das suas moedas ({intervalo_h}h):*

source: 📅 Fecha: {fecha} _🔰 Alerta configurada cada {intervalo_h} horas._
pt: 📅 Data: {fecha} _🔰 Alerta configurado a cada {intervalo_h} horas._

source: 🚫 Comando no autorizado.
pt: 🚫 Comando não autorizado.

source: ✍️ *Creación de Mensaje Masivo* Por favor, envía el contenido principal del mensaje. Puedes enviar una imagen, un texto, o una imagen con texto.
pt: ✍️ *Criação de Mensagem em Massa* Por favor, envie o conteúdo principal da mensagem. Pode enviar uma imagem, um texto, ou uma imagem com texto.

source: 🖼️ Añadir Imagen
pt: 🖼️ Adicionar Imagem

source: ➡️ Enviar Solo Texto
pt: ➡️ Enviar Somente Texto

source: ✍️ Añadir/Editar Texto
pt: ✍️ Adicionar/Editar Texto

source: ➡️ Enviar Solo Imagen
pt: ➡️ Enviar Somente Imagem

source: ✅ Texto recebido. ¿Deseas añadir una imagen o enviar el mensaje?
pt: ✅ Texto recebido. Deseja adicionar uma imagem ou enviar a mensagem?

source: ✅ Imagen recibida. ¿Deseas añadir o editar el texto del pie de foto?
pt: ✅ Imagem recebida. Deseja adicionar ou editar o texto da legenda?

source: ⚠️ Por favor, envía un texto o una imagen.
pt: ⚠️ Por favor, envie um texto ou uma imagem.

source: ✍️ De acuerdo, por favor envía el texto que quieres usar como pie de foto.
pt: ✍️ De acordo, por favor, envie o texto que deseja usar como legenda.

source: 🖼️ Entendido, por favor envía la imagen que quieres adjuntar.
pt: 🖼️ Entendido, por favor, envie a imagem que deseja anexar.

source: 🚫 Operación cancelada.
pt: 🚫 Operação cancelada.

source: 🚀 Enviar a todos los usuarios
pt: 🚀 Enviar para todos os usuários

source: ✅ Texto añadido. El mensaje está listo para ser enviado.
pt: ✅ Texto adicionado. A mensagem está pronta para ser enviada.

source: ✅ Imagen añadida. El mensaje está listo para ser enviado.
pt: ✅ Imagem adicionada. A mensagem está pronta para ser enviada.

source: ⏳ *Enviando mensaje a todos los usuarios...* Esto puede tardar un momento.
pt: ⏳ *Enviando mensagem para todos os usuários...* Isso pode levar um momento.

source: ❌ Error interno: La función de envío masivo no ha sido inicializada.
pt: ❌ Erro interno: A função de envio em massa não foi inicializada.

source: ✅ Envío completado. Enviado a *{total_enviados}* de {total_usuarios} usuarios. ❌ Fallos ({num_fallos}): {fallidos_str}
pt: ✅ Envio concluído. Enviado para *{total_enviados}* de {total_usuarios} usuários. ❌ Falhas ({num_fallos}): {fallidos_str}

source: ✅ ¡Éxito! Mensaje enviado a todos los *{total_usuarios}* usuarios.
pt: ✅ Sucesso! Mensagem enviada para todos os *{total_usuarios}* usuários.

source: 😕 No estás registrado en el sistema.
pt: 😕 Não está registrado no sistema.

source: 👤 *Tu Perfil Registrado* ———————————————————— - Nombre: {nombre_completo} - 🪪 ID: `{user_id}` - 👤 Usuario: {username_str} - 🪙 Monedas: `{monedas_str}` - ⏰ Alerta cada: {intervalo_h}h - 🔔 Alertas activas: {alertas_activas} ———————————————————— _Solo puedes ver tu propia información 🙂_
pt: 👤 *Seu Perfil Registrado* ———————————————————— - Nome: {nombre_completo} - 🪪 ID: `{user_id}` - 👤 Usuário: {username_str} - 🪙 Moedas: `{monedas_str}` - ⏰ Alerta a cada: {intervalo_h}h - 🔔 Alertas ativas: {alertas_activas} ———————————————————— _Apenas pode ver a sua própria informação 🙂_

source: 👥 *Usuarios Registrados*: {num_usuarios} ———————————————————— ```{detalles_str}```
pt: 👥 *Usuários Registrados*: {num_usuarios} ———————————————————— ```{detalles_str}```

source: 🤖 *Estado de BitBread Alert* ———————————————————— • Versión: {version} 🤖 • Estado: {estado} 👌 • Última Actualización: {ultima_actualizacion} 🕒 ———————————————————— _Ya, eso es todo lo que puedes ver 🙂👍_
pt: 🤖 *Status do BitBread Alert* ———————————————————— • Versão: {version} 🤖 • Status: {estado} 👌 • Última Atualização: {ultima_actualizacion} 🕒 ———————————————————— _Sim, isso é tudo o que pode ver 🙂👍_

source: ❌ Error interno: La función de logs no ha sido inicializada.
pt: ❌ Erro interno: A função de logs não foi inicializada.

source: ⚠️ El argumento debe ser un número entero.
pt: ⚠️ O argumento deve ser um número inteiro.

source: 🤖 *Estado de BitBread Alert* ———————————————————— • Versión: {version} 🤖 • PID: {pid} 🪪 • Python: {python_version} 🐍 • Usuarios: {num_usuarios} 👥 • Estado: {estado} 👌 • Última Actualización: {ultima_actualizacion} 🕒 ———————————————————— •📜 *Últimas {num_lineas} líneas de {total_lineas} * ```{log_str}```
pt: 🤖 *Status do BitBread Alert* ———————————————————— • Versão: {version} 🤖 • PID: {pid} 🪪 • Python: {python_version} 🐍 • Usuários: {num_usuarios} 👥 • Status: {estado} 👌 • Última Atualização: {ultima_actualizacion} 🕒 ———————————————————— •📜 *Últimas {num_lineas} linhas de {total_lineas} * ```{log_str}```

source: ⚠️ *Formato incorrecto*. El uso correcto es: /alerta *MONEDA PRECIO* Ejemplo: `/alerta HIVE 0.35`
pt: ⚠️ *Formato incorreto*. O uso correto é: /alerta *MOEDA PREÇO* Exemplo: `/alerta HIVE 0.35`

source: ⚠️ El precio que ingresaste no es válido. Debe ser un número positivo.
pt: ⚠️ O preço que inseriu não é válido. Deve ser um número positivo.

source: ✅ ¡Alertas creadas! Te avisaré cuando *{coin}* cruce por encima o por debajo de *${target_price:,.4f}*.
pt: ✅ Alertas criadas! Iremos notificá-lo quando *{coin}* cruzar acima ou abaixo de *${target_price:,.4f}*.

source: 📊 Precio actual: `{initial_price:,.4f}`
pt: 📊 Preço atual: `{initial_price:,.4f}`

source: No tienes ninguna alerta de precio activa. Crea una con el comando /alerta.
pt: Não possui nenhum alerta de preço ativo. Crie um com o comando /alerta.

source: 🔔 *Tus Alertas de Precio Activas:*
pt: 🔔 *Seus Alertas de Preço Ativos:*

source: 🧹 Borrar Todas
pt: 🧹 Excluir Todos

source: ✅ Alerta borrada. Ya no tienes alertas activas.
pt: ✅ Alerta excluído. Já não possui alertas ativos.

source: ✅ Todas tus alertas han sido eliminadas.
pt: ✅ Todos os seus alertas foram eliminados.

source: *Hola👋 {nombre_usuario}!* Bienvenido a BitBreadAlert. Para recibir alertas periódicas con los precios de tu lista de monedas, usa el comando `/monedas` seguido de los símbolos separados por comas. Puedes usar *cualquier* símbolo de criptomoneda listado en CoinMarketCap. Ejemplo: `/monedas BTC, ETH, TRX, HIVE, ADA` Puedes modificar la temporalidad de esta alerta en cualquier momento con el comando /temp seguido de las horas (entre 0.5 y 24.0). Ejemplo: /temp 2.5 (para 2 horas y 30 minutos)
pt: *Olá👋 {nombre_usuario}!* Bem-vindo(a) ao BitBreadAlert. Para receber alertas periódicos com os preços da sua lista de moedas, utilize o comando `/monedas` seguido dos símbolos separados por vírgulas. Pode usar *qualquer* símbolo de criptomoeda listado no CoinMarketCap. Exemplo: `/monedas BTC, ETH, TRX, HIVE, ADA` Pode modificar a periodicidade deste alerta a qualquer momento com o comando /temp seguido das horas (entre 0.5 e 24.0). Exemplo: /temp 2.5 (para 2 horas e 30 minutos)

source: ⚠️ No hay registros de precios aún.
pt: ⚠️ Não há registos de preços ainda.

source: 📊 *Última lectura (máx. 5 min atrás):* 🟠 *BTC/USD*: ${btc_val:,.2f} 🔷 *TON/USD*: ${ton_val:,.4f} 🐝 *HIVE/USD*: ${hive_val:,.4f} 💰 *HBD/USD*: ${hbd_val:,.4f} _Actualizado: {fecha}_
pt: 📊 *Última leitura (máx. 5 min atrás):* 🟠 *BTC/USD*: ${btc_val:,.2f} 🔷 *TON/USD*: ${ton_val:,.4f} 🐝 *HIVE/USD*: ${hive_val:,.4f} 💰 *HBD/USD*: ${hbd_val:,.4f} _Atualizado: {fecha}_

source: Estos son tus datos de Telegram: Nombre: {nombre} Usuario: {usuario} ID: `{id_chat}`
pt: Estes são os seus dados do Telegram: Nome: {nombre} Usuário: {usuario} ID: `{id_chat}`

source: ⚠️ *Formato incorrecto*. Uso: `/graf <MONEDA> [MONEDA_PAR] <TEMPORALIDAD>` Ejemplos: `/graf BTC 15m` `/graf BTC USDT 1h`
pt: ⚠️ *Formato incorreto*. Uso: `/graf <MOEDA> [MOEDA_PAR] <TEMPORALIDADE>` Exemplos: `/graf BTC 15m` `/graf BTC USDT 1h`

source: ⚠️ *Temporalidad no válida*. Usa: 1m, 5m, 15m, 1h, 4h, 1d, 1w, 1M.
pt: ⚠️ *Periodicidade não válida*. Use: 1m, 5m, 15m, 1h, 4h, 1d, 1w, 1M.

source: ⏳ Generando gráfico para *{base}/{quote}* ({temporalidad})...
pt: ⏳ Gerando gráfico para *{base}/{quote}* ({temporalidad})...

source: 📈 *Gráfico de {base}/{quote} ({temporalidad})* [Ver en TradingView]({url})
pt: 📈 *Gráfico de {base}/{quote} ({temporalidad})* [Ver no TradingView]({url})

source: ❌ Lo siento, no pude generar la captura del gráfico en este momento. Inténtalo de nuevo más tarde.
pt: ❌ Lamentamos, não foi possível gerar a captura do gráfico neste momento. Tente novamente mais tarde.

source: ⚠️ *Formato incorrecto*. Uso: `/p <MONEDA>` Ejemplo: `/p BTC`
pt: ⚠️ *Formato incorreto*. Uso: `/p <MOEDA>` Exemplo: `/p BTC`

source: 😕 No se pudieron obtener los datos para *{moneda}*.
pt: 😕 Não foi possível obter os dados para *{moneda}*.

source: H|L:
pt: A|B:

source: ✅ ¡Lista de monedas actualizada! Ahora recibirás alertas de para: `{monedas_limpias_str}` Puedes cambiar esta lista en cualquier momento enviando una nueva lista de símbolos separados por comas.
pt: ✅ Lista de moedas atualizada! Agora receberá alertas para: `{monedas_limpias_str}` Pode alterar esta lista a qualquer momento enviando uma nova lista de símbolos separados por vírgulas.

source: ⚠️ Por favor, envía una lista de símbolos de monedas separados por comas. Ejemplo: `BTC, ETH, HIVE`
pt: ⚠️ Por favor, envie uma lista de símbolos de moedas separados por vírgulas. Exemplo: `BTC, ETH, HIVE`

source: ✅ Listo! recibirás alertas para las siguientes monedas: `{monedas_str}`.
pt: ✅ Pronto! receberá alertas para as seguintes moedas: `{monedas_str}`.

source: ⚠️ No tienes monedas configuradas para la alerta de tempralidad.
pt: ⚠️ Não tem moedas configuradas para o alerta de periodicidade.

source: 🛑 Alertas detenidas. Ya no recibirás mensajes cada hora (a menos que vuelvas a configurar tu lista o ajustes la temporalidad).
pt: 🛑 Alertas parados. Já não receberá mensagens a cada hora (a menos que volte a configurar a sua lista ou ajuste a periodicidade).

source: ⚙️ *Configuración de Temporalidad* Tu intervalo de alerta actual es de *{intervalo_actual} horas*. Para cambiarlo, envía el comando con las horas deseadas (desde 1h hasta 12h). Ejemplo: `/temp 2.5` (para 2 horas y 30 minutos).
pt: ⚙️ *Configuração de Periodicidade* O seu intervalo de alerta atual é de *{intervalo_actual} horas*. Para alterá-lo, envie o comando com as horas desejadas (de 1h até 12h). Exemplo: `/temp 2.5` (para 2 horas e 30 minutos).

source: ⚠️ El valor debe ser un número entre *0.5* (30min) y *24.0* horas. Ejemplo: `2.5`
pt: ⚠️ O valor deve ser um número entre *0.5* (30min) e *24.0* horas. Exemplo: `2.5`

source: ❌ No se pudo guardar tu configuración. ¿Estás registrado con /start?
pt: ❌ Não foi possível guardar a sua configuração. Está registado com /start?

source: ✅ ¡Temporalidad de alerta actualizada a *{interval_h} horas*! La alerta con tus monedas ha sido *reprogramada* para ejecutarse cada {interval_h} horas.
pt: ✅ Periodicidade de alerta atualizada para *{interval_h} horas*! O alerta com as suas moedas foi *reprogramado* para ser executado a cada {interval_h} horas.

source: ✅ ¡Temporalidad de alerta actualizada a *{interval_h} horas*! ⚠️ Pero hubo un error al reprogramar la alerta. Intenta enviar /temp nuevamente.
pt: ✅ Periodicidade de alerta atualizada para *{interval_h} horas*! ⚠️ Mas houve um erro ao reprogramar o alerta. Tente enviar /temp novamente.

source: ⚠️ Formato de hora inválido. Usa un número como `2` o `2.5` (minimo 0.5)(máximo 24.0).
pt: ⚠️ Formato de hora inválido. Use um número como `2` ou `2.5` (mínimo 0.5)(máximo 24.0).

source: ⚠️ Debes especificar el número de horas. Ejemplo: `/temp 2.5`
pt: ⚠️ Deve especificar o número de horas. Exemplo: `/temp 2.5`

source: ninguna
pt: nenhuma

source: ⚠️ *Formato incorrecto*. Para establecer tu lista de monedas, envía el comando seguido de los símbolos. Ejemplo: `/monedas BTC, ETH, HIVE, SOL` Tu lista actual es: {lista_str}
pt: ⚠️ *Formato incorreto*. Para definir a sua lista de moedas, envie o comando seguido dos símbolos. Exemplo: `/monedas BTC, ETH, HIVE, SOL` A sua lista atual é: {lista_str}

source: ⚠️ No pude encontrar ninguna moneda en tu mensaje. Intenta de nuevo.
pt: ⚠️ Não foi possível encontrar nenhuma moeda na sua mensagem. Tente novamente.

source: ✅ *Tu lista de monedas ha sido guardada.* Precios actuales:
pt: ✅ *A sua lista de moedas foi guardada.* Preços atuais:

source: No encontrado
pt: Não encontrado

source: ✅ *Tu lista de monedas ha sido guardada*, pero no pude obtener los precios en este momento.
pt: ✅ *A sua lista de moedas foi guardada*, mas não foi possível obter os preços neste momento.

source: ✅ Tus alertas predefinidas de HBD están *ACTIVADAS*.
pt: ✅ Os seus alertas predefinidos de HBD estão *ATIVADOS*.

source: 🔕 Desactivar alertas
pt: 🔕 Desativar alertas

source: ☑️ Tus alertas predefinidas de HBD están *DESACTIVADAS*.
pt: ☑️ Os seus alertas predefinidos de HBD estão *DESATIVADOS*.

source: 🔔 Activar alertas
pt: 🔔 Ativar alertas

source: ✅ ¡Alertas de HBD *activadas*! Volverás a recibir notificaciones.
pt: ✅ Alertas de HBD *ativadas*! Voltará a receber notificações.

source: ☑️ Alertas de HBD *desactivadas*. Ya no recibirás estos mensajes.
pt: ☑️ Alertas de HBD *desativadas*. Já não receberá estas mensagens.

source: 🔔 Activar alertas de HBD
pt: 🔔 Ativar alertas de HBD

source: 🌐 *Selecciona tu idioma:* El idioma actual es: {current_lang_name}
pt: 🌐 *Selecione o seu idioma:* O idioma atual é: {current_lang_name}

source: ✅ ¡Idioma cambiado a **{new_lang_name}**! Usa el comando /lang si deseas cambiarlo de nuevo.
pt: ✅ Idioma alterado para **{new_lang_name}**! Use o comando /lang se desejar alterá-lo novamente.

source: ⚠️ Idioma no soportado.
pt: ⚠️ Idioma não suportado.
